; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v4 ?v8)
             (pred_9 ?v7 ?v2)
             (pred_2 ?v4 ?v2)
             (pred_7 ?v11 ?v4 )
	     (pred_11 ?v4)
             (pred_12 ?v5)
             (pred_1 ?v7)
             (pred_4 ?v2)
             (pred_10 ?v4)
             (pred_3 ?v7)
             (pred_5 ?v4)
             (pred_8 ))



(:action op_3
:parameters (?v10 ?v3 ?v6 ?v13)
:precondition (and (pred_12 ?v10) (pred_12 ?v3) (pred_1 ?v6) (pred_4 ?v13)
          (pred_6 ?v10 ?v3) (pred_9 ?v6 ?v13)
                   (pred_2 ?v3 ?v13) (pred_11 ?v10) 
                   (pred_10 ?v3) (pred_3 ?v6))
:effect (and  (pred_5 ?v3) (not (pred_10 ?v3))))


(:action op_4
:parameters (?v10 ?v12)
:precondition (and (pred_12 ?v10) (pred_12 ?v12)
               (pred_11 ?v10) (pred_6 ?v10 ?v12) (pred_5 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v10))))

(:action op_5
:parameters (?v10 ?v6)
:precondition (and (pred_12 ?v10) (pred_1 ?v6) 
                  (pred_11 ?v10) (pred_7 ?v6 ?v10) (pred_8 ))
:effect (and (pred_3 ?v6)
   (not (pred_7 ?v6 ?v10)) (not (pred_8 ))))


(:action op_1
:parameters (?v10 ?v1 ?v9)
:precondition (and (pred_12 ?v10) (pred_1 ?v1) (pred_1 ?v9)
                  (pred_11 ?v10) (pred_3 ?v9) (pred_7 ?v1 ?v10))
:effect (and (pred_3 ?v1) (pred_7 ?v9 ?v10)
        (not (pred_3 ?v9)) (not (pred_7 ?v1 ?v10))))

(:action op_2
:parameters (?v10 ?v6)
:precondition (and (pred_12 ?v10) (pred_1 ?v6) 
                  (pred_11 ?v10) (pred_3 ?v6))
:effect (and (pred_8 ) (pred_7 ?v6 ?v10) (not (pred_3 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_04 obj_15 obj_05 obj_07 obj_13 obj_20 obj_19 obj_14 obj_10 obj_09 obj_17 obj_16 obj_03 obj_02 obj_06
    obj_11 obj_08
    obj_18 obj_01 obj_21
    )

    (:init
       (pred_8)

       (pred_12 obj_12)
       (pred_12 obj_04)
       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_07)
       (pred_12 obj_13)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_09)
       (pred_12 obj_17)
       (pred_12 obj_16)
       (pred_12 obj_03)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_4 obj_11)
       (pred_4 obj_08)
       (pred_1 obj_18)
       (pred_1 obj_01)
       (pred_1 obj_21)

       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_04 obj_13)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_05)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_13 obj_07)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_19 obj_05)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_16 obj_03)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_16)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_06 obj_02)
       (pred_10 obj_15)
       (pred_10 obj_05)
       (pred_10 obj_17)
       (pred_2  obj_15 obj_11)
       (pred_2  obj_05 obj_08)
       (pred_2  obj_17 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_13)
       (pred_5 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_03)
       (pred_5 obj_02)
       (pred_5 obj_06)

       (pred_9  obj_18 obj_11)
       (pred_9  obj_01 obj_08)
       (pred_9  obj_21 obj_08)
       (pred_7 obj_18 obj_20)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_21 obj_07)
       (pred_11 obj_14)
    )

    (:goal (and
       (pred_7 obj_18 obj_02)
       (pred_7 obj_01 obj_10)
       (pred_7 obj_21 obj_04)
    ))
(:constraints
  (always (not (pred_11 obj_13)))
)
)

; plan
1. (op_4 obj_14 obj_07)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_07)
   goals met: 0 of 3
2. (op_5 obj_07 obj_21)
   deleted: (pred_7 obj_21 obj_07) (pred_8)
   added: (pred_3 obj_21)
   goals met: 0 of 3
3. (op_4 obj_07 obj_12)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_12)
   goals met: 0 of 3
4. (op_4 obj_12 obj_04)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_04)
   goals met: 0 of 3
5. (op_2 obj_04 obj_21)
   deleted: (pred_3 obj_21)
   added: (pred_8) (pred_7 obj_21 obj_04)
   goals met: 1 of 3
6. (op_4 obj_04 obj_12)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_12)
   goals met: 1 of 3
7. (op_4 obj_12 obj_07)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_07)
   goals met: 1 of 3
8. (op_5 obj_07 obj_01)
   deleted: (pred_7 obj_01 obj_07) (pred_8)
   added: (pred_3 obj_01)
   goals met: 1 of 3
9. (op_4 obj_07 obj_14)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_14)
   goals met: 1 of 3
10. (op_4 obj_14 obj_10)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_10)
   goals met: 1 of 3
11. (op_2 obj_10 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_8) (pred_7 obj_01 obj_10)
   goals met: 2 of 3
12. (op_4 obj_10 obj_09)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_09)
   goals met: 2 of 3
13. (op_4 obj_09 obj_20)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_20)
   goals met: 2 of 3
14. (op_5 obj_20 obj_18)
   deleted: (pred_7 obj_18 obj_20) (pred_8)
   added: (pred_3 obj_18)
   goals met: 2 of 3
15. (op_4 obj_20 obj_09)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_09)
   goals met: 2 of 3
16. (op_4 obj_09 obj_02)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_02)
   goals met: 2 of 3
17. (op_2 obj_02 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_8) (pred_7 obj_18 obj_02)
   goals met: 3 of 3
